# Создать список, состоящий из четных чисел в диапазоне от 1 до 100.

list_1= []
print(list_1)

for i in range (1, 101):
    list_1.append(i)
print(list_1)

list_2=[i for i in range(-100, 1)]
print(list_2)